## Plan Result (sandbox-enterprise)




<pre><code>Plan: 302 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_application.appreg
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group_member.dnszonecontributor
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_application_insights.appinsight
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_function_app.funcapp
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault.kv
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.Reader
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.kvaccess
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.kvgroupaccess
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_storage_account.stg
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_application.appreg
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group_member.dnszonecontributor
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_application_insights.appinsight
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_function_app.funcapp
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault.kv
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.Reader
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.kvaccess
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.kvgroupaccess
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_storage_account.stg
  * module.environment[&#34;demo&#34;].azuread_application.app
  * module.environment[&#34;demo&#34;].azuread_application_password.token
  * module.environment[&#34;demo&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;demo&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;demo&#34;].azuread_group_member.acr
  * module.environment[&#34;demo&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;demo&#34;].azuread_service_principal.sp
  * module.environment[&#34;demo&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;demo&#34;].azurerm_resource_group.rg
  * module.environment[&#34;demo&#34;].random_uuid.app_uuid
  * module.environment[&#34;demo&#34;].time_rotating.one_year
  * module.environment[&#34;dev&#34;].azuread_application.app
  * module.environment[&#34;dev&#34;].azuread_application_password.token
  * module.environment[&#34;dev&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;dev&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;dev&#34;].azuread_group_member.acr
  * module.environment[&#34;dev&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;dev&#34;].azuread_service_principal.sp
  * module.environment[&#34;dev&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;dev&#34;].azurerm_resource_group.rg
  * module.environment[&#34;dev&#34;].random_uuid.app_uuid
  * module.environment[&#34;dev&#34;].time_rotating.one_year
  * module.environment[&#34;ithc&#34;].azuread_application.app
  * module.environment[&#34;ithc&#34;].azuread_application_password.token
  * module.environment[&#34;ithc&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ithc&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;ithc&#34;].azuread_group_member.acr
  * module.environment[&#34;ithc&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;ithc&#34;].azuread_service_principal.sp
  * module.environment[&#34;ithc&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;ithc&#34;].azurerm_resource_group.rg
  * module.environment[&#34;ithc&#34;].random_uuid.app_uuid
  * module.environment[&#34;ithc&#34;].time_rotating.one_year
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;prod&#34;].azuread_application_password.token
  * module.environment[&#34;prod&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;prod&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;prod&#34;].azuread_group_member.acr
  * module.environment[&#34;prod&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;prod&#34;].azuread_service_principal.sp
  * module.environment[&#34;prod&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;prod&#34;].azurerm_resource_group.rg
  * module.environment[&#34;prod&#34;].random_uuid.app_uuid
  * module.environment[&#34;prod&#34;].time_rotating.one_year
  * module.environment[&#34;ptl&#34;].azuread_application.app
  * module.environment[&#34;ptl&#34;].azuread_application_password.token
  * module.environment[&#34;ptl&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ptl&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;ptl&#34;].azuread_group_member.acr
  * module.environment[&#34;ptl&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;ptl&#34;].azuread_service_principal.sp
  * module.environment[&#34;ptl&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;ptl&#34;].azurerm_resource_group.rg
  * module.environment[&#34;ptl&#34;].random_uuid.app_uuid
  * module.environment[&#34;ptl&#34;].time_rotating.one_year
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_application_password.token
  * module.environment[&#34;ptlsbox&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ptlsbox&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;ptlsbox&#34;].azuread_group_member.acr
  * module.environment[&#34;ptlsbox&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;ptlsbox&#34;].azuread_service_principal.sp
  * module.environment[&#34;ptlsbox&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;ptlsbox&#34;].azurerm_resource_group.rg
  * module.environment[&#34;ptlsbox&#34;].random_uuid.app_uuid
  * module.environment[&#34;ptlsbox&#34;].time_rotating.one_year
  * module.environment[&#34;sbox&#34;].azuread_application.app
  * module.environment[&#34;sbox&#34;].azuread_application_password.token
  * module.environment[&#34;sbox&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;sbox&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;sbox&#34;].azuread_group_member.acr
  * module.environment[&#34;sbox&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;sbox&#34;].azuread_service_principal.sp
  * module.environment[&#34;sbox&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;sbox&#34;].azurerm_resource_group.rg
  * module.environment[&#34;sbox&#34;].random_uuid.app_uuid
  * module.environment[&#34;sbox&#34;].time_rotating.one_year
  * module.environment[&#34;stg&#34;].azuread_application.app
  * module.environment[&#34;stg&#34;].azuread_application_password.token
  * module.environment[&#34;stg&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;stg&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;stg&#34;].azuread_group_member.acr
  * module.environment[&#34;stg&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;stg&#34;].azuread_service_principal.sp
  * module.environment[&#34;stg&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;stg&#34;].azurerm_resource_group.rg
  * module.environment[&#34;stg&#34;].random_uuid.app_uuid
  * module.environment[&#34;stg&#34;].time_rotating.one_year
  * module.environment[&#34;test&#34;].azuread_application.app
  * module.environment[&#34;test&#34;].azuread_application_password.token
  * module.environment[&#34;test&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;test&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;test&#34;].azuread_group_member.acr
  * module.environment[&#34;test&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;test&#34;].azuread_service_principal.sp
  * module.environment[&#34;test&#34;].azurerm_app_service_plan.asp
  * module.environment[&#34;test&#34;].azurerm_resource_group.rg
  * module.environment[&#34;test&#34;].random_uuid.app_uuid
  * module.environment[&#34;test&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_application.app
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_application.app
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_application.app
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_application.app
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].time_rotating.one_year




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.acme["DTS-Terraform-Dev-Test3"].azuread_application.appreg will be created
  + resource "azuread_application" "appreg" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "acme-dts-terraform-dev-test3"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d"
              + type = "Scope"
            }
        }

      + web {
          + redirect_uris = [
              + "https://acmedtsterraformdevtest3.azurewebsites.net/.auth/login/aad/callback",
            ]

          + implicit_grant {
              + access_token_issuance_enabled = true
              + id_token_issuance_enabled     = true
            }
        }
    }

  # module.acme["DTS-Terraform-Dev-Test3"].azuread_group_member.dnszonecontributor will be created
  + resource "azuread_group_member" "dnszonecontributor" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.acme["DTS-Terraform-Dev-Test3"].azurerm_application_insights.appinsight will be created
  + resource "azurerm_application_insights" "appinsight" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "acmedtsterraformdevtest3"
      + resource_group_name                   = "enterprise-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
    }

  # module.acme["DTS-Terraform-Dev-Test3"].azurerm_function_app.funcapp will be created
  + resource "azurerm_function_app" "funcapp" {
      + app_service_plan_id             = (known after apply)
      + app_settings                    = (known after apply)
      + custom_domain_verification_id   = (known after apply)
      + default_hostname                = (known after apply)
      + enable_builtin_logging          = true
      + enabled                         = true
      + https_only                      = false
      + id                              = (known after apply)
      + key_vault_reference_identity_id = (known after apply)
      + kind                            = (known after apply)
      + location                        = "uksouth"
      + name                            = "acmedtsterraformdevtest3"
      + outbound_ip_addresses           = (known after apply)
      + possible_outbound_ip_addresses  = (known after apply)
      + resource_group_name             = "enterprise-dev-rg"
      + site_credential                 = (known after apply)
      + storage_account_access_key      = (sensitive value)
      + storage_account_name            = "acmedtsterraformdevtest3"
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + version                         = "~3"

      + auth_settings {
          + default_provider              = "AzureActiveDirectory"
          + enabled                       = true
          + token_refresh_extension_hours = 72
          + token_store_enabled           = false
          + unauthenticated_client_action = "RedirectToLoginPage"

          + active_directory {
              + client_id = (known after apply)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                        = (known after apply)
          + app_scale_limit                  = (known after apply)
          + auto_swap_slot_name              = (known after apply)
          + dotnet_framework_version         = (known after apply)
          + elastic_instance_minimum         = (known after apply)
          + ftps_state                       = (known after apply)
          + health_check_path                = (known after apply)
          + http2_enabled                    = (known after apply)
          + ip_restriction                   = (known after apply)
          + java_version                     = (known after apply)
          + linux_fx_version                 = (known after apply)
          + min_tls_version                  = (known after apply)
          + pre_warmed_instance_count        = (known after apply)
          + runtime_scale_monitoring_enabled = (known after apply)
          + scm_ip_restriction               = (known after apply)
          + scm_type                         = (known after apply)
          + scm_use_main_ip_restriction      = (known after apply)
          + use_32_bit_worker_process        = (known after apply)
          + vnet_route_all_enabled           = (known after apply)
          + websockets_enabled               = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }
    }

  # module.acme["DTS-Terraform-Dev-Test3"].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_deployment        = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "acmedtsterraformdevtest3"
      + public_network_access_enabled = true
      + resource_group_name           = "enterprise-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + tenant_id                     = "e575f663-b30a-4786-89ad-319842dfe853"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.acme["DTS-Terraform-Dev-Test3"].azurerm_role_assignment.Reader will be created
  + resource "azurerm_role_assignment" "Reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.acme["DTS-Terraform-Dev-Test3"].azurerm_role_assignment.kvaccess will be created
  + resource "azurerm_role_assignment" "kvaccess" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.acme["DTS-Terraform-Dev-Test3"].azurerm_role_assignment.kvgroupaccess will be created
  + resource "azurerm_role_assignment" "kvgroupaccess" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9b200a9c-8c0b-497a-9246-2c9b4dcc0d02"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.acme["DTS-Terraform-Dev-Test3"].azurerm_storage_account.stg will be created
  + resource "azurerm_storage_account" "stg" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "acmedtsterraformdevtest3"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "enterprise-dev-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.acme["DTS-Terraform-Dev-Test4"].azuread_application.appreg will be created
  + resource "azuread_application" "appreg" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "acme-dts-terraform-dev-test4"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d"
              + type = "Scope"
            }
        }

      + web {
          + redirect_uris = [
              + "https://acmedtsterraformdevtest4.azurewebsites.net/.auth/login/aad/callback",
            ]

          + implicit_grant {
              + access_token_issuance_enabled = true
              + id_token_issuance_enabled     = true
            }
        }
    }

  # module.acme["DTS-Terraform-Dev-Test4"].azuread_group_member.dnszonecontributor will be created
  + resource "azuread_group_member" "dnszonecontributor" {
      + group_object_id  = (known after apply)
      + id           

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

fter apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_groups["Contributor"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_groups["Owner"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_groups["Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_groups["Storage Blob Data Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["Monitoring Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "74f495b8-66b2-4f43-ad96-d94fbb78cb26"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Contributor"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["Network Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "74f495b8-66b2-4f43-ad96-d94fbb78cb26"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "cbb9ca405b539e8b3sa"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azure-control-prod-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_storage_container.sc will be created
  + resource "azurerm_storage_container" "sc" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "subscription-tfstate"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "cbb9ca405b539e8b3sa"
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 302 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"sandbox-enterprise","Vars":{}} -->